---
kind: property
id: P:Autodesk.Revit.DB.PolylineSegments.EndLocalParameter
source: html/eec72e2d-a591-7595-7245-87659b0b6c63.htm
---
# Autodesk.Revit.DB.PolylineSegments.EndLocalParameter Property

Local parameter associated with the end point.

## Syntax (C#)
```csharp
public double EndLocalParameter { get; }
```